{
  "projects": [
    {
      "title": "Phasmophobia Buddy",
      "description": "Unofficial companion app for Phasmophobia, an indie online multiplayer horror game",
      "site_url": "https://phasmophobiabuddy.com/",
      "repo_url": "https://github.com/JacobSolomonUCF/phasmophobia-buddy",
      "icon": "ghost"
    },
    {
      "title": "50 Years of Storms",
      "description": "(1964-2015) Atlantic hurricane data presented in a interactive way. Utilizes AWS Lambda, API Gateway, DynamoDB, S3 & Cloudfront.",
      "site_url": "https://50yearsofstorms.com/",
      "repo_url": "https://github.com/JacobSolomonUCF/50yearsofstorms",
      "icon": "umbrella"
    },
    {
      "title": "PDFaaS",
      "description": "Serverless stack build with AWS SAM. Provides the generation of PDFs and Images using Google's Puppeteer library running on AWS Lambda",
      "repo_url": "https://github.com/JacobSolomonUCF/PDFaaS",
      "icon": "file-pdf"
    },
    {
      "title": "Oviedo Fire Department Inventory Reporting System",
      "description": "UCF Senior Design Project. Complete inventory reporting tool that featured native iOS & Android applications paired with an Angular2 web application built on the Google Cloud",
      "repo_url": "https://github.com/JacobSolomonUCF/OviedoFireSD",
      "icon": "fire"
    }
  ],
  "experience": [
    {
      "company": "Crown Castle",
      "title": "Software Developer",
      "start_date": "July 2019",
      "end_date": "Present",
      "task": [
        "Led implementation and development of a company-wide internal GIS React Native mobile application",
        "Assembled a high performance MVT Server using FastAPI",
        "Worked closely with external partners to develop a proprietary data analytics platform for visualizing crowdsourced big data via Deck.GL"
      ]
    },
    {
      "company": "Siemens Energy",
      "title": "Full Stack Developer",
      "start_date": "March 2018",
      "end_date": "July 2019",
      "task": [
        "Led implementation and development of key improvements to a inhouse Enterprise CMS (built using Ember JS / Python) resulting in major improvements in content editing & usability",
        "Designed and developed serverless architecture (for both Python & NodeJS microservices) resulting in over 90% reduction in existing infrastructure cost",
        "Collaborated across multiple teams / projects using different technologies like Python, NodeJS, EmberJS, React",
        "Drove IAM (AuthN & AuthZ) implementations utilizing JWT tokens for Single Sign On across a suite of applications",
        "Coordinated closely with Product Managers to understand value proposition of development pipeline to customers and provide guidance on technical complexity and risk to help streamline release and iteration planning"
      ]
    },
    {
      "company": "Siemens Energy",
      "title": "Data Analyst",
      "start_date": "January 2017",
      "end_date": "March 2018",
      "task": [
        "Created custom interactive Tableau workbooks leveraging multiple database connections",
        "Developed & maintained regional SharePoint site",
        "Was responsible for IAM management for regional resources"
      ]
    },
    {
      "company": "Publix Supermarkets",
      "title": "Grocery Replenishment Specialist",
      "start_date": "October 2011",
      "end_date": "January 2017",
      "task": [
        "Analyzed stock orders to manage inventory levels",
        "Helped with weekly sales forecasting and display planning",
        "Was responsible for training new employees"
      ]
    }
  ],
  "about": {
    "github": "https://github.com/JacobSolomonUCF",
    "linkedin": "https://www.linkedin.com/in/jacob-solomon-a81a7912b/",
    "summary": "Hi, I like to build things! Currently employed by Crown Castle, where I'm focused on solving complex problems with the best technical solutions.",
    "info": [
      {
        "text": "When I'm not developing, I love spending time with my fiancée Amber, and our dog Louie.",
        "photo": "graduation"
      },
      {
        "text": "Being born & raised in Central Florida, I have always enjoyed being outdoors.",
        "photo": "outdoors"
      }
    ]
  }
}
